---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AppearanceAssetEditScope
source: html/3732b5cf-23ff-10d4-3574-9e2b77dc39fe.htm
---
# AppearanceAssetEditScope Properties

Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.